# HW 5 - Titanic 

In this HW, we would like to better understand what features of the passengers are helpful for predicting whether they survived or not. Whether the passanger survived (1) or not (0) is given in the Survived column.

In [9]:
import pandas as pd
from pandasql import sqldf

df_titanic = pd.read_csv("Titanic.csv",index_col=0)

First read in the dataframe into a variable called df_titanic. Use the head method to check that you have read everything correctly.

In [10]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr.
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs.
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss.
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs.
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr.

**Question 1 (SQL + Plotting):** Write 4 separate queries to create the following 4 dataframe, which should each have an Age and Fare columns (We won't use the Fare column , but this is just for practice):

- Mr_survived : Have a title of Mr. and they survived.
- Mr_died: Have title of Mr. and they died.
- Mrs_survived : Have a title of Mrs. and they survived.
- Mrs_died: Have title of Mrs. and they died.

In [13]:
df_Mr_survived= sqldf("SELECT Survived, Title, Age, Fare FROM df_titanic WHERE Survived='1' AND Title='Mr.'")
df_Mr_survived.head()

   Survived Title   Age     Fare
0         1   Mr.   NaN  13.0000
1         1   Mr.  34.0  13.0000
2         1   Mr.  28.0  35.5000
3         1   Mr.   NaN   7.2292
4         1   Mr.   NaN  35.5000

In [14]:
df_Mr_died= sqldf("SELECT Survived, Title, Age, Fare FROM df_titanic WHERE Survived='0' AND Title='Mr.'")
df_Mr_died.head()

   Survived Title   Age     Fare
0         0   Mr.  22.0   7.2500
1         0   Mr.  35.0   8.0500
2         0   Mr.   NaN   8.4583
3         0   Mr.  54.0  51.8625
4         0   Mr.  20.0   8.0500

In [15]:
df_Mrs_survived= sqldf("SELECT Survived, Title, Age, Fare FROM df_titanic WHERE Survived='1' AND Title='Mrs.'")
df_Mrs_survived.head()

   Survived Title   Age     Fare
0         1  Mrs.  38.0  71.2833
1         1  Mrs.  35.0  53.1000
2         1  Mrs.  27.0  11.1333
3         1  Mrs.  14.0  30.0708
4         1  Mrs.  55.0  16.0000

In [16]:
df_Mrs_died= sqldf("SELECT Survived, Title, Age, Fare FROM df_titanic WHERE Survived='0' AND Title='Mrs.'")
df_Mrs_died.head()

   Survived Title   Age    Fare
0         0  Mrs.  31.0  18.000
1         0  Mrs.  40.0   9.475
2         0  Mrs.  27.0  21.000
3         0  Mrs.  18.0  17.800
4         0  Mrs.  47.0  14.500

Each of these dataframes has Ages missing. For each data frame, fill in the missing Ages with the average age of the other passengers in that dataframe.

In [22]:
df_Mr_survived_age= sqldf("SELECT avg(Age) as avg_age FROM df_Mr_survived")  
df_Mr_survived_age
#Write your code here

     avg_age
0  33.044776

In [24]:
df_Mr_died_age= sqldf("SELECT avg(Age) as avg_age FROM df_Mr_died")  
df_Mr_died_age

     avg_age
0  32.231118

In [25]:
df_Mrs_survived_age= sqldf("SELECT avg(Age) as avg_age FROM df_Mrs_survived")  
df_Mrs_survived_age

     avg_age
0  35.535714

In [17]:
df_Mrs_died_age= sqldf("SELECT avg(Age) as avg_age FROM df_Mrs_died")  
df_Mrs_died_age.head()

     avg_age
0  36.086957

Now, produce the following histograms, which shows the distribution of ages of Mr./Mrs. who survived/dies. I set figsize = (12,6) and you may find the alpha input to the plot() method useful for getting the transparent nature of the plots below.

 <img src="First_Plot.png">

In [5]:
#Write your code here to produce the plots

**Question 2 (SQL):** Write a single query which finds the fraction of first class (Pclass = 1) female passengers who survived.

In [45]:
sqldf("SELECT Survived, COUNT(Survived) AS Total_Counts FROM df_titanic WHERE Survived='1'AND Sex='female'AND Pclass='1'")/sqldf("SELECT Survived, Count(Survived) AS Total_Counts FROM df_titanic WHERE Sex='female'AND Pclass='1'")

   Survived  Total_Counts
0       1.0      0.967391

**Question 3 (SQL)**:  Write a single query which finds the max fare paid from passengers who embarked from each port.

In [19]:
sqldf("SELECT Embarked,Max(Fare) FROM df_titanic GROUP BY Embarked")

  Embarked  Max(Fare)
0        C   512.3292
1        Q    90.0000
2        S   263.0000

**Question 4 (SQL)**:  Update the previous query to find the max fare paid from passengers who embarked from each port at each class (Pclass).

In [20]:
sqldf("SELECT Pclass,Embarked,Max(Fare) FROM df_titanic GROUP BY Embarked,Pclass")

   Pclass Embarked  Max(Fare)
0       1        C   512.3292
1       2        C    41.5792
2       3        C    22.3583
3       1        Q    90.0000
4       2        Q    12.3500
5       3        Q    29.1250
6       1        S   263.0000
7       2        S    73.5000
8       3        S    69.5500

**Question 5 (SQL):**  Write a single query to find the combined survival percentage of males over >=50 and women over >=40. Hint: Use CASE.

In [ ]:
sqldf("SELECT ")